# ViewportCantContainEmptyView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewSheetFailures..::..ViewportCantContainEmptyView Property
BuiltInFailures..::..ViewSheetFailures Class See Also
---
Sheet views cannot contain empty view "%1!s!".
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ViewportCantContainEmptyView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewportCantContainEmptyView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ViewportCantContainEmptyView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewSheetFailures Class
Autodesk.Revit.DB Namespace